2023-10-27/517f849de0-STDY.org
#+INCLUDE: "../../prefix.org"

#+TITLE: 提交补丁到社区的方法

REFERENCE:https://www.kernel.org/doc/html/latest/process/submitting-patches.html
获取当前源代码树:
git clone git://git.kernel.org/pub/scm/linux/kernel/git/torvalds/linux.git
可能你不想直接针对mainline进行开发，大多数子系统维护者由他们自己的树，并希望补丁是
以他们的树进行准备的；针对子系统查看T: entry，在MAINTAINERS文件中找到目标树，如果
没有列在这里，可以直接询问维护者；

描述你的改变：
- 描述你的问题；无论补丁多小多大，都需要做这个工作；使reviewer者信服，你所提交的部分值得完善；
- 描述用户可见的影响；
- 量化优化和权衡；如果你旨在提升性能，内存消耗，stack footprint，或二进制文件大小，需要
  包括具体的数字来说明；但同样需要描述不明显的消费；优化通常不是只影响单方面的，需要权衡
  CPU，内存和可读性；或者当涉及到heuristics时，还需要考虑不同负载；描述你能预料到的，优化
  带来的负作用，以便reviewer可以进行对比；
- 一旦问题建立之后，需要以更详细的技术详情描述你真正在做什么；
- 如果你写的描述可以让维护者直接提交到Linux的源代码管理系统，维护者将会非常感谢；具体官方
  补丁格式见https://www.kernel.org/doc/html/latest/process/submitting-patches.html#the-canonical-patch-format
- 一个补丁只解决一个问题；
- 当你提交或重新提交一个补丁或补丁系列时，要包括完整的补丁描述和纠正；不要只说这是版本几；
- 以祈使语气描述所作的改变，e.g. "make xyzzy do frotz" instead of "[This patch] makes xyzzy do frotz" or "[I] changed xyzzy to do frotz", as if you are giving orders to the codebase to change its behaviour.
- 如果你要引用指定的commit，不要只填commitid，请把那个commit的第一行概括添加上；
  #+begin_src example
    Commit e21d2170f36602ae2708 ("video: remove unnecessary
    platform_set_drvdata()") removed the unnecessary
    platform_set_drvdata(), but left the variable "dev" unused,
    delete it.
  #+end_src
- 如果能找到关于这个改变的其他讨论或背景信息，请加上link，如：Link: https://lore.kernel.org/r/30th.anniversary.repost@klaava.Helsinki.FI/
- 